spacemacs_init.org
#+STARTUP: overview indent

* System
** Custom variables/functions

#+begin_src emacs-lisp
(load "~/.spacemacs.d/private/elisp/my-vars.el")
(load "~/.spacemacs.d/private/elisp/my-funs.el")
#+end_src

** use-package
*** Usage
- use-packageで可読性の高いinit.elを書く
  https://qiita.com/kai2nenobu/items/5dfae3767514584f5220

- Keyword
  |-----------------+------------------------------------------------------------|
  | keyword         | description                                                |
  |-----------------+------------------------------------------------------------|
  | :init           | ロード前に読み込む設定                                     |
  |                 | 遅延キーワードがあっても必ず読み込まれる                   |
  |                 | Use Case: 特定の key-map へのキー割り当て                  |
  |                 | Use Case: 特定の mode-hook で mode 割り当て                |
  | :config         | ロード後に読み込む設定 (~eval-after-load~)                   |
  | :if             | 条件に合致した場合のみ読み込まれる (~when~)                  |
  |-----------------+------------------------------------------------------------|
  | :commands       | autoload するコマンドを指定. 実行時に遅延ロード (~autoload~) |
  | :bind           | コマンドをキーに割り当てる (キー押下時に遅延ロード)        |
  |                 | global-map へのキー割り当てのみ                            |
  |                 | Use Case: モードに依存しないツールへの設定                 |
  | :bind*          | 全ての major-mode の bind を上書き                         |
  | :mode           | 拡張子と major-mode の関連付け (~auto-mode-alist~)           |
  |                 | 該当する拡張子のファイルを開くと遅延ロード                 |
  | :interpreter    | Shebang と major-mode の関連付け (~interpreter-mode-alist~)  |
  |                 | 該当する Shebang のファイルを開くと遅延ロード              |
  | :defer          | もともと遅延ロードの設定がされているライブラリへの設定     |
  |                 | :commands で設定しなくても :defer t だけで OK              |
  |-----------------+------------------------------------------------------------|
  | :disabled       | 設定を無効化. 一時的に無視したいときなど                   |
  | :preface        | :disabled を除くすべてのキーワードよりも先に実行される     |
  |                 | Use Case: :if 内で使う関数定義                             |
  | :magic          | (~magic-mode-alist~)                                         |
  | :magic-fallback | (~magic-fallback-mode-alist~)                                |
  | :hook           | パッケージに関連付ける hook の設定                         |
  | :bind-keymap    |                                                            |
  | :bind-keymap*   |                                                            |
  | :after          |                                                            |
  | :demand         |                                                            |
  | :defines        |                                                            |
  | :functions      |                                                            |
  | :load-path      |                                                            |
  | :diminish       |                                                            |
  | :delight        |                                                            |
  | :custom         |                                                            |
  | :custom-face    |                                                            |
  | :ensure         | パッケージがない場合、package.el でインストールする        |
  | :pin            |                                                            |
  |-----------------+------------------------------------------------------------|

** backup file

- http://yohshiy.blog.fc2.com/blog-entry-319.html

| foo.txt~   | バックアップファイル                                   | 特定のディレクトリにまとめておく |
| #foo.txt#  | 自動保存ファイル. 異常終了時に利用 (~recover-this-file~) | 終了時に自動削除される           |
| .saves-xxx | 自動保存ファイルリスト                                 | 終了時に自動削除される           |
| .#foo.txt  | ロックファイル                                         | 終了時に自動削除される           |

#+begin_src emacs-lisp
;; 1つのディレクトリにまとめて保存
;; (add-to-list 'backup-directory-alist
;;         (cons ".*" (expand-file-name "~/.emacs.d/backup")))
#+end_src

** recentf

#+begin_src emacs-lisp
(use-package recentf-ext
  :config
  (setq recentf-max-saved-items 2000)
  (setq recentf-exclude '(".recentf"))
  (setq recentf-auto-cleanup 10)
  (run-with-idle-timer 30 t 'recentf-save-list)
  (recentf-mode 1))
#+end_src

** Tab width

#+begin_src emacs-lisp
(setq-default tab-width 4)
#+end_src

** Version controll

#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src

* UI
** Theme

#+begin_src emacs-lisp
(use-package doom-themes
  :config
  ;; (doom-themes-treemacs-config)
  (doom-themes-org-config))
#+end_src

** Frame size

#+begin_src emacs-lisp
(when (display-graphic-p)
  (set-frame-size (selected-frame) 140 50))
#+end_src

** Font
*** Reference
- ディスプレイのサイズ (DPI) に応じて設定
  https://emacs.stackexchange.com/questions/28390/quickly-adjusting-text-to-dpi-changes

- 文芸用エディタ
  https://qiita.com/Duct-and-rice/items/ad77ab8b41b0cd83f1ec

- Emacs のフォント設定を克服する
  http://extra-vision.blogspot.com/2016/07/emacs.html

- Emacsのフォントを設定する
  https://qiita.com/j8takagi/items/01aecdd28f87cdd3cd2c
   
- ubuntuで動かすemacsの日本語フォントを調整する方法
  http://asukiaaa.blogspot.com/2017/11/ubuntuemacs.html

- Beautifying Org Mode in Emacs
  https://zzamboni.org/post/beautifying-org-mode-in-emacs/

*** Usage
**** Workflow
1. カスタムの fontset を作成する
   ~create-fontset-from-ascii-font~
2. fontset の特定の character-set (文字コード)に対して、font-spec でフォントを指定
   ~set-fontset-font~
3. fontset を frame もしくは face に適応する
   ~(add-to-list 'default-frame-alist '(font . "fontset-name"))~

**** font-spec

- フォントの書式設定方法
- set-face-attriutes と同じ書式をもつ
- フォントを扱う関数の引数として渡す用途が多い
- ~(font-spec :family "hoge" :size 14 :weight 'bold  :slant 'italic :width 'normal)~

**** character-sets

- 文字集合データベース
- ~M-x list-character-sets~
  japanese-jisx0208
  japanese-jisx0208-1978
  japanese-jisx0212
  japanese-jisx0213-1
  japanese-jisx0213-2
  japanese-jisx0213-a
  japanese-jisx0213.2004-1
  jisx0201
  katakana-jisx0201
  katakana-sjis
  latin-jisx0201
- Final Byte の違いで複数種類ある

**** fontset

- 複数の character-set とフォントの対応表
- どの文字コードに、どのフォントを使うか

- ~M-x list-fontsets~
- デフォルトでは、以下の fontset が見える
  fontset-default  (他で指定がない場合は、ここにフォールバックする)
  fontset-standard (中身は空で、fontset-default にフォールバックする)
  fontset-startup

- 各々の fontset  の中身
- ~M-x describe-fontset~

- ~set-fontset-font~ で、fontset の特定の character-set に対して、font-spec を設定
- fontset が nil の場合は、現在の frame の fontset

**** face-attribute

- face-attribute の :height は default face に対しての相対サイズ (1.2 など) でも指定できる
- default face は絶対サイズ (1/10 pt) で指定する

*** Size Check

|abcdef ghijkl|
|ABCDEF GHIJKL|
|'";:-+ =/\~`?|
|∞≤≥∏∑∫ ×±⊆⊇|
|αβγδεζ ηθικλμ|
|ΑΒΓΔΕΖ ΗΘΙΚΛΜ|

|abcdef ghijkl|
|ABCDEF GHIJKL|
|日本語 の美観|
|あいう えおか|
|アイウ エオカ|
|ｱｲｳｴｵｶ ｷｸｹｺｻｼ|

*** Settings

#+begin_src emacs-lisp
;;; Fixed pitch font
;; Japanese fonts
(set-fontset-font nil 'japanese-jisx0213.2004-1 (font-spec :family my-vars/jp-font-family))
(set-fontset-font nil 'katakana-jisx0201 (font-spec :family my-vars/jp-font-family))

;; Overwrite latin and greek char's font
(set-fontset-font nil '(#x0250 . #x02AF) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x00A0 . #x00FF) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0100 . #x017F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0180 . #x024F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2018 . #x2019) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2588 . #x2588) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2500 . #x2500) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2504 . #x257F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0370 . #x03FF) (font-spec :family my-vars/default-font-family))

;;; Variable pitch font
(create-fontset-from-ascii-font my-vars/default-propotional-font-family nil "variable")
(set-fontset-font "fontset-variable" 'japanese-jisx0213.2004-1
        (font-spec :family my-vars/jp-propotional-font-family))
(set-fontset-font "fontset-variable" 'katakana-jisx0201
                  (font-spec :family my-vars/jp-propotional-font-family))
(set-face-attribute 'variable-pitch nil
            :fontset "fontset-variable"
            :inherit 'default)

;;; Adjust scale
(add-to-list 'face-font-rescale-alist '(".*Meiryo*." . 1.09))
(add-to-list 'face-font-rescale-alist '(".*Yu Mincho*." . 1.09))
#+end_src

** treemacs

#+begin_src emacs-lisp
(use-package treemacs
  :config
  (setq treemacs-position 'right))
#+end_src

** highlight-indent-guides

#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook
  ;; (emacs-lisp-mode . highlight-indent-guides-mode)
  (ess-r-mode      . highlight-indent-guides-mode)
  (csharp-mode     . highlight-indent-guides-mode)
  :config
  ;; (setq highlight-indent-guides-responsive t)
  (setq highlight-indent-guides-method 'character))
#+end_src

* Auto complete
** auto-complete

#+begin_src emacs-lisp
(setq completion-ignore-case t)
(setq read-file-name-completion-ignore-case t)
(setq read-buffer-completion-ignore-case t)
#+end_src

** ivy-rich

#+begin_src emacs-lisp
(use-package ivy-rich
  :config
  ;; ivy-posframe-width 130
  (setq
   ivy-rich-display-transformers-list
   '(
     ivy-switch-buffer
     (:columns
      (
       ;; (my-funs/ivy-rich-buffer-icon (:width 5))
       (ivy-rich-candidate (:width 30))
       (ivy-rich-switch-buffer-size (:width 7 :align right))
       (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
       (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
       (ivy-rich-switch-buffer-project (:width 15 :face success))
       (ivy-rich-switch-buffer-path (:width 57)))
      :predicate
      (lambda (cand) (get-buffer cand)))

     counsel-M-x
     (:columns
      ((counsel-M-x-transformer (:width 40))
       (ivy-rich-counsel-function-docstring (:width 89 :face font-lock-doc-face))))

     counsel-describe-function
     (:columns
      ((counsel-describe-function-transformer (:width 40))
       (ivy-rich-counsel-function-docstring (:width 89 :face font-lock-doc-face))))

     counsel-describe-variable
     (:columns
      ((counsel-describe-variable-transformer (:width 40))
       (ivy-rich-counsel-variable-docstring (:width 89 :face font-lock-doc-face))))

     counsel-find-file
     (:columns
      ((ivy-read-file-transformer)
       (ivy-rich-counsel-find-file-truename (:face font-lock-doc-face))))

     counsel-recentf
     (:columns
      (
       ;; (my-funs/ivy-rich-file-icon (:width 5))
	   (ivy-rich-candidate (:width 110))
       (ivy-rich-file-last-modified-time (:width 19 :face font-lock-comment-face))))

     package-install
     (:columns
      ((ivy-rich-candidate (:width 30))
       (ivy-rich-package-version (:width 16 :face font-lock-comment-face))
       (ivy-rich-package-archive-summary (:width 7 :face font-lock-builtin-face))
       (ivy-rich-package-install-summary (:width 74 :face font-lock-doc-face))))
     ))
  ;; Restart ivy-rich-mode
  (ivy-rich-mode -1)
  (ivy-rich-mode))
#+end_src

