spacemacs_init.el
(load "~/.spacemacs.d/private/elisp/my-vars.el")
(load "~/.spacemacs.d/private/elisp/my-funs.el")

;; 1つのディレクトリにまとめて保存
;; (add-to-list 'backup-directory-alist
;;         (cons ".*" (expand-file-name "~/.emacs.d/backup")))

(use-package recentf-ext
  :config
  (setq recentf-max-saved-items 2000)
  (setq recentf-exclude '(".recentf"))
  (setq recentf-auto-cleanup 10)
  (run-with-idle-timer 30 t 'recentf-save-list)
  (recentf-mode 1))

(setq-default tab-width 4)

(setq vc-follow-symlinks t)

(use-package doom-themes
  :config
  ;; (doom-themes-treemacs-config)
  (doom-themes-org-config))

(when (display-graphic-p)
  (set-frame-size (selected-frame) 140 50))

;;; Fixed pitch font
;; Japanese fonts
(set-fontset-font nil 'japanese-jisx0213.2004-1 (font-spec :family my-vars/jp-font-family))
(set-fontset-font nil 'katakana-jisx0201 (font-spec :family my-vars/jp-font-family))

;; Overwrite latin and greek char's font
(set-fontset-font nil '(#x0250 . #x02AF) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x00A0 . #x00FF) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0100 . #x017F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0180 . #x024F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2018 . #x2019) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2588 . #x2588) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2500 . #x2500) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x2504 . #x257F) (font-spec :family my-vars/default-font-family))
(set-fontset-font nil '(#x0370 . #x03FF) (font-spec :family my-vars/default-font-family))

;;; Variable pitch font
(create-fontset-from-ascii-font my-vars/default-propotional-font-family nil "variable")
(set-fontset-font "fontset-variable" 'japanese-jisx0213.2004-1
        (font-spec :family my-vars/jp-propotional-font-family))
(set-fontset-font "fontset-variable" 'katakana-jisx0201
                  (font-spec :family my-vars/jp-propotional-font-family))
(set-face-attribute 'variable-pitch nil
            :fontset "fontset-variable"
            :inherit 'default)

;;; Adjust scale
(add-to-list 'face-font-rescale-alist '(".*Meiryo*." . 1.09))
(add-to-list 'face-font-rescale-alist '(".*Yu Mincho*." . 1.09))

(use-package treemacs
  :config
  (setq treemacs-position 'right))

(use-package highlight-indent-guides
  :hook
  ;; (emacs-lisp-mode . highlight-indent-guides-mode)
  (ess-r-mode      . highlight-indent-guides-mode)
  (csharp-mode     . highlight-indent-guides-mode)
  :config
  ;; (setq highlight-indent-guides-responsive t)
  (setq highlight-indent-guides-method 'character))

(setq completion-ignore-case t)
(setq read-file-name-completion-ignore-case t)
(setq read-buffer-completion-ignore-case t)

(use-package ivy-rich
  :config
  ;; ivy-posframe-width 130
  (setq
   ivy-rich-display-transformers-list
   '(
     ivy-switch-buffer
     (:columns
      (
       ;; (my-funs/ivy-rich-buffer-icon (:width 5))
       (ivy-rich-candidate (:width 30))
       (ivy-rich-switch-buffer-size (:width 7 :align right))
       (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
       (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
       (ivy-rich-switch-buffer-project (:width 15 :face success))
       (ivy-rich-switch-buffer-path (:width 57)))
      :predicate
      (lambda (cand) (get-buffer cand)))

     counsel-M-x
     (:columns
      ((counsel-M-x-transformer (:width 40))
       (ivy-rich-counsel-function-docstring (:width 89 :face font-lock-doc-face))))

     counsel-describe-function
     (:columns
      ((counsel-describe-function-transformer (:width 40))
       (ivy-rich-counsel-function-docstring (:width 89 :face font-lock-doc-face))))

     counsel-describe-variable
     (:columns
      ((counsel-describe-variable-transformer (:width 40))
       (ivy-rich-counsel-variable-docstring (:width 89 :face font-lock-doc-face))))

     counsel-find-file
     (:columns
      ((ivy-read-file-transformer)
       (ivy-rich-counsel-find-file-truename (:face font-lock-doc-face))))

     counsel-recentf
     (:columns
      (
       ;; (my-funs/ivy-rich-file-icon (:width 5))
	   (ivy-rich-candidate (:width 110))
       (ivy-rich-file-last-modified-time (:width 19 :face font-lock-comment-face))))

     package-install
     (:columns
      ((ivy-rich-candidate (:width 30))
       (ivy-rich-package-version (:width 16 :face font-lock-comment-face))
       (ivy-rich-package-archive-summary (:width 7 :face font-lock-builtin-face))
       (ivy-rich-package-install-summary (:width 74 :face font-lock-doc-face))))
     ))
  ;; Restart ivy-rich-mode
  (ivy-rich-mode -1)
  (ivy-rich-mode))
