spacemacs_init.org
** ivy-posframe

#+begin_src emacs-lisp
(use-package ivy-posframe
  :config
  (setq ivy-posframe-parameters '((left-fringe . 5) (right-fringe . 5)))
  (setq ivy-posframe-width 130)
  (setq ivy-posframe-height 10)

  ;; Per command settings
  (setq ivy-posframe-display-functions-alist
		'((swiper . nil)
		  (t      . ivy-posframe-display-at-frame-center)))

  ;; Per command height settings
  (setq ivy-posframe-height-alist
				'((swiper . 20)
				  (t      . 10)))

  (ivy-posframe-mode)
  :custom-face
  ;; See ivy-posframe-parameters
  (ivy-posframe ((t (:background "#282a36"))))
  (ivy-posframe-border ((t (:background "#6272a4"))))
  (ivy-posframe-cursor ((t (:background "#61bfff")))))
#+end_src

* Org
** org

- Adding files to the agenda list recursively?
  https://www.reddit.com/r/orgmode/comments/6q6cdk/adding_files_to_the_agenda_list_recursively/

- Aligned Agenda View. Anyway to make this more clean? IE, having the TODO Keywords all line up?
  https://www.reddit.com/r/orgmode/comments/6ybjjw/aligned_agenda_view_anyway_to_make_this_more/

#+begin_src emacs-lisp
(use-package org
  :config
  ;;; Appearance
  ;; Replace "-" with "•"
  (font-lock-add-keywords
    'org-mode
    '(("^ *\\([-]\\) "
      (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (setq org-hide-emphasis-markers t)
  ;;; org-agenda
  ;; Add agenda file recursively
  (setq org-agenda-files
  (apply 'append
          (mapcar (lambda (directory)
        (directory-files-recursively directory org-agenda-file-regexp))
            '("~/Dropbox/memo"))))
  ;; agenda format
  ;; (setq org-agenda-prefix-format
  ;;       (quote
  ;;        ((agenda . " %i %-12:c%?12t% s")
  ;;         (todo   . " %i %-12:c")
  ;;         (tags   . " %i %-12:c")
  ;;         (search . " %i %-12:c"))))
  ;;; org-babel
  (setq org-confirm-babel-evaluate nil)
  (setq org-src-preserve-indentation t)
  (setq org-src-tab-acts-natively nil)
  ;;; Latex preview
  (setq org-preview-latex-image-directory "~/Dropbox/memo/img/latex/")
  ;; (setq org-preview-latex-default-process 'dvisvgm)
  (plist-put org-format-latex-options :scale 1.5)
  ;;; Custom function to get ramdom file name
  (cl-defun get-babel-file (&key
                            (dir "~/Dropbox/memo/img/babel/")
                            (prefix "fig-")
                            (suffix ".png"))
    (concat dir (make-temp-name prefix) suffix)))

;; Change font size by levels
;; (custom-set-faces
;;  '(org-level-1 ((t (:inherit outline-1 :height 1.35))))
;;  '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
;;  '(org-level-3 ((t (:inherit outline-3 :height 1.25))))
;;  '(org-level-4 ((t (:inherit outline-4 :height 1.0)))))
#+end_src

** org-bullets

#+begin_src emacs-lisp
(use-package org-bullets
  :commands (org-bullets-mode)
  :init
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  :config
  (setq org-bullets-bullet-list '("" "" "" "" "" "" "" "" "")))
#+end_src

** org-babel-eval-in-repl

#+begin_src emacs-lisp
;; (use-package org-babel-eval-in-repl
;;   :init
;;   (bind-keys :map org-mode-map ("C-<return>" . ober-eval-in-repl)))
#+end_src

** org-variable-pitch

- https://www.reddit.com/r/emacs/comments/66w75c/monospace_font_for_calendar_in_orgmode/
FONTS
Set variable-pitch font using customize-face variable-pitch
Set the fonts to format correctly for specific modes. Default is set for fixed
 so we only need to have the exceptions

#+begin_src emacs-lisp
;; (add-hook 'org-mode-hook 'org-variable-pitch-minor-mode)
;; (require 'org-variable-pitch)

;; (defun set-buffer-variable-pitch ()
;;   (interactive)
;;   (variable-pitch-mode t)
;;   (setq line-spacing 3)
;;   (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
;;   (set-face-attribute 'org-link nil :inherit 'fixed-pitch)
;;   (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
;;   (set-face-attribute 'org-block nil :inherit 'fixed-pitch)
;;   (set-face-attribute 'org-date nil :inherit 'fixed-pitch)
;;   (set-face-attribute 'org-special-keyword nil :inherit 'fixed-pitch))

;; (add-hook 'org-mode-hook 'set-buffer-variable-pitch)
;; (add-hook 'markdown-mode-hook 'set-buffer-variable-pitch)
;; (add-hook 'Info-mode-hook 'set-buffer-variable-pitch)

#+end_src

* Language
** R
*** ess

#+begin_src emacs-lisp
(use-package ess
  ;; Enable company for iESS
  ;; :hook
  ;; (inferior-ess-r-mode . company-mode)
  :config
  (use-package ess-r-mode)
  (setq ess-eldoc-show-on-symbol t)
  (setq ess-history-file nil)
  (setq ess-use-R-completion nil)
  (setq ess-use-auto-complete nil)
  (setq ess-use-ido nil)
  ;; (setq ess-ask-about-transfile nil)
  ;; (setq ess-ask-for-ess-directory nil)
  ;; (setq inferior-R-args "")
  ;; (setq ess-indent-with-fancy-comments nil)

  ;;; ess-R-object-popup
  (add-to-list 'load-path "~/Dropbox/repos/github/myuhe/ess-R-object-popup.el")
  (use-package ess-R-object-popup)

  ;; ESS
  (spacemacs/set-leader-keys-for-major-mode 'ess-r-mode
    ;; "SPC" 'ess-view-inspect-df
    ;; "" 'ess-describe-object-at-point
    ;; "" 'ess-r-set-evaluation-env
    "."   'ess-R-object-popup)
  (spacemacs/set-leader-keys-for-major-mode 'inferior-ess-r-mode
    "v" 'ess-view-inspect-df
    "l" 'comint-clear-buffer
    "r" 'inferior-ess-reload)

  (dolist (m (list ess-r-mode-map inferior-ess-r-mode-map org-mode-map))
    (bind-keys :map m
               ("C-=" . my-funs/insert-R-assign)
               ("C->" . my-funs/insert-R-pipe))))

#+end_src

*** ess-view

#+begin_src emacs-lisp
(use-package ess-view
  :if (eq system-type 'gnu/linux)
  :config
  (setq ess-view--spreadsheet-program "/usr/bin/gnumeric")
  :if (eq system-type 'windows-nt)
  :config
  (setq ess-view--spreadsheet-program
        "c:/Program Files (x86)/Microsoft Office/root/Office16/EXCEL.EXE"))
#+end_src

*** ess-spreadsheet

#+begin_src emacs-lisp
(add-to-list 'load-path "~/Dropbox/repos/private/elisp/ess-spreadsheet")
(require 'ess-spreadsheet)

;; (spacemacs/set-leader-keys-for-major-mode 'ess-r-mode
;;   "h SPC" 'ess-spreadsheet)
#+end_src

*** inlineR

#+begin_src emacs-lisp
(add-to-list 'load-path "~/Dropbox/repos/github/myuhe/inlineR.el")
(use-package inlineR)
#+end_src

** C#
* Utility
** Paradox

#+begin_src emacs-lisp
(use-package paradox
  :config
  (setq paradox-github-token "144882f652e8d571fa68755827e29defe71d7b21"))
#+end_src

* Japanese
** mozc

#+begin_src emacs-lisp
(use-package mozc
  :config
  (setq default-input-method "japanese-mozc")
  (setq mozc-candidate-style 'echo-area)

  (bind-keys :map evil-insert-state-map
             ([muhenkan] . my-funs/toggle-ime)
             ([henkan]   . my-funs/deactivate-ime))
  ;; mozc.el で無変換キー/全角半角キーでちゃんと mozc-mode を切る
  ;; http://nos.hateblo.jp/entry/20120317/1331985029
  (defadvice mozc-handle-event (around intercept-keys (event))
    (if (member event (list 'zenkaku-hankaku 'henkan))
        (progn
          (mozc-clean-up-session)
          (toggle-input-method))
      (progn
        ; (message "%s" event) ; debug
        ad-do-it)))
  (ad-activate 'mozc-handle-event)
  ;; Disable IME w/o insert mode
  (add-hook 'evil-insert-state-exit-hook 'my-funs/deactivate-ime))
#+end_src

** +mozc-im+

#+begin_src emacs-lisp
(use-package mozc-im
  :disabled t
  :config
  (setq default-input-method "japanese-mozc-im"))
#+end_src

** +mozc-popup+

#+begin_src emacs-lisp
(use-package mozc-popup
  :disabled t
  :config
  (setq mozc-candidate-style 'popup))
#+end_src

** mozc-el-extensions

#+begin_src emacs-lisp
(add-to-list 'load-path "~/Dropbox/repos/github/iRi-E/mozc-el-extensions")
(require 'mozc-mode-line-indicator)
(require 'mozc-isearch)
;; (require 'mozc-cursor-color)
#+end_src

** +mozc-posframe+

#+begin_src emacs-lisp
;; (add-to-list 'load-path "~/Dropbox/repos/github/derui/mozc-posframe")
;; (require 'mozc-posframe)
;; (setq mozc-candidate-style 'posframe)
#+end_src

** migemo

#+begin_src emacs-lisp
(use-package migemo
  :if (eq system-type 'gnu/linux)
  :config
  (setq migemo-dictionary "/usr/share/cmigemo/utf-8/migemo-dict")
  :if (eq system-type 'windows-nt)
  :config
  (setq migemo-dictionary "C:/Users/shun/AppData/Local/cmigemo-default-win64/dict/utf-8/migemo-dict"))
#+end_src

